#ifndef JUGEMRODSIGNAL_H
#define JUGEMRODSIGNAL_H

#include "JSystem/J3D/J3DAnmTexPattern.h"
#include "JSystem/JGeometry/Vec.h"
#include "JSystem/JKernel/JKRHeap.h"
#include "JSystem/J3D/J3DModel.h"
#include "JSystem/J3D/J3DAnmTevRegKey.h"
#include "JSystem/JParticle/JPAEmitter.h"
#include "Sato/AnmController.h"
#include "Sato/GeographyObj.h"
#include "Sato/J3DAnmObject.h"
#include "Shiraiwa/AnmPlayer.h"

// probably inherited from TJugemMain
// TODO: virtual function overrides

class TJugemRodItem : public GeographyObj
{
public:
    TJugemRodItem(u32 id) : GeographyObj(id) {
        setObjFlagHidding();
    }
    virtual ~TJugemRodItem() {}
    virtual void setPosition(const JGeometry::TVec3f &rPos) { mPos.set(rPos); }       // 80
    virtual void setRMtx(const JGeometry::TPos3f &rMtx) { mRotMtx.set(rMtx.mMtx); }  // 84
    virtual void show(u8) { // 88
        clrObjFlagHidding();
    }
    virtual void hide() { setObjFlagHidding(); } // 8C
    virtual void hideAll() { hide(); }           // 90
    virtual void changeAnimation(int) {}         // 94

    static const s32 cJugemRodItem_Max;
    TAnmPlayer mAnmPlayer;
};

class TJugemRodSignal : public TJugemRodItem
{ // Autogenerated
public:
    // Global
    TJugemRodSignal();                                         // 0x80293558
    ~TJugemRodSignal();                                        // 0x80293630
    void reset();                                              // 0x80293710
    void loadAnimation();                                      // 0x802937e4
    virtual const char * getShadowBmdFileName();               // 0x80293864
    virtual const char *getBmdFileName();                      // 0x8029386c
    void createModel(JKRSolidHeap *, u32);                     // 0x80293894
    void createColModel(J3DModelData *);                       // 0x802939ec
    void calc();                                               // 0x802939f0
    void createEmitter(JPABaseEmitter **, long, const char *); // 0x80293bbc
    void startCountDown();                                     // 0x80293c60
    void show(u8);                                             // 0x80293c74
    void update();                                             // 0x80293cac
    bool isAcceptEffect();                                     // 0x80293e74

    // Inline/Unused
    void getJointPos(JGeometry::TVec3f *, long);
    void updatePosition(JPABaseEmitter **, long);

    //  Inline
    bool isCallThree() { return _188 == scSignalInterval - 1; }

    static const char *scRedParticleName;           // 0x80415160
    static const char *scGreenParticleName;         // 0x80415164
    static J3DAnmTevRegKey *sJugemRodSignalBrkAnm;  // 0x80416da8
    static s16 sRandomWait;                         // 0x80416dac
    static int sLeftJointNo;                        // 0x80416db0
    static int sMiddleJointNo;                      // 0x80416db4
    static int sRightJointNo;                       // 0x80416db8
    static const u8 scSignalInterval;               // 0x8041c7d8
    static const u8 scRandomLength;                 // UNUSED

    J3DAnmObjMaterial _164;         // 164
    bool _184;                      // 184
    //u8 _185[0x188 - 0x185];       // 185 - Padding.
    s32 _188;                       // 188
    u8 mKartCamIndex;               // 18c
    //u8 _18d[0x190 - 0x18d];       // 18d - Padding.
    JPABaseEmitter *mEmitterLeft;   // 190
    JPABaseEmitter *mEmitterMiddle; // 194
    JPABaseEmitter *mEmitterRight;  // 198
}; // Size: 0x19c

class TJugemRodPukuPuku : public TJugemRodItem
{
public:
    TJugemRodPukuPuku();
    ~TJugemRodPukuPuku();
    void reset();
    void loadAnimation();
    void createModel(JKRSolidHeap *, u32);
    void show(u8);
    void update();
    void calc();
    void setPosition(const JGeometry::TVec3<float> &);
    void setRMtx(const JGeometry::TPos3f &);
    void setCurrentViewNo(u32);
    static bool nodeCallBack(J3DJoint *, int);

    const char *getBmdFileName() { return "/Objects/puku_model.bmd"; }
    u32 getJ3DModelDataTevStageNum() const { return 0x20020; }

    // Inline/Unused
    void getCurMatrix(Mtx);
    // void scCutFrame;
    static TAnmInfo sAnmInfos_Puku_Demo2[3];
    static TAnmInfo sAnmInfos_Puku_Demo3[1];
    static TJugemAnmTableEntry sDemoAnmStateTable[3];

private:
    AnmController *mAnmController[3];
    u8 _170;    // 0x170
    s8 _171;    // 0x171
}; // Size: 0x174


class TJugemRodBoard : public TJugemRodItem {
public:
    TJugemRodBoard();
    ~TJugemRodBoard();
    void reset();
    void loadAnimation();
    const char *getBmdFileName();
    void createModel(JKRSolidHeap *, u32);
    void show(u8);
    void update();
    void calc() {}


    static J3DAnmTexPattern *sJugemRodBoardBtpAnm;
    static const f32 scObjScale[4];


    J3DAnmObjMaterial _164;
};

class TJugemRodBoard2 : public TJugemRodItem {
public:
    TJugemRodBoard2();
    ~TJugemRodBoard2();
    void reset();
    void loadAnimation();
    const char *getBmdFileName();
    void createModel(JKRSolidHeap *, u32);
    void show(u8);
    void update();
    void calc() { _164.update(); }

    static J3DAnmTevRegKey *sJugemRodBoard2BrkAnm;
    static const f32 scObjScale[4];

    J3DAnmObjMaterial _164;
};

class TJugemRodBoardRev : public TJugemRodItem {
public:
    TJugemRodBoardRev();
    ~TJugemRodBoardRev();
    void reset();
    void loadAnimation();
    const char *getBmdFileName();
    void createModel(JKRSolidHeap *, u32);
    void show(u8);
    void update();
    void calc() { _164.update(); }

    static J3DAnmTevRegKey *sJugemRodBoardRevBrkAnm;
    static const f32 scObjScale[4];

    J3DAnmObjMaterial _164;
};

#endif
